---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AreaReinforcementCurve
source: html/3963cca4-c83c-7ef9-734b-0602abd3162b.htm
---
# AreaReinforcementCurve Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.